; domain
(define (domain blocksworld)
    (:requirements :strips :typing)
    (:types cube tower robot)

    (:predicates 
     (ontable ?x - cube)
     (on ?x - cube ?y - cube)
     (clear ?x - cube)
     (handempty ?r - robot)
     (holding ?r - robot ?x - cube)
     (ontower ?x - cube ?t - tower)

     (adjacent-left ?x - cube ?y - cube)
     (adjacent-right ?x - cube ?y - cube)
     (adjacent-top ?x - cube ?y - cube)
     (triangle-three ?x - cube ?top - cube ?mid - cube)
     )

    (:action pick-up
     :parameters (?r - robot ?x - cube)
     :precondition (and (ontable ?x) (clear ?x) (handempty ?r))
     :effect (and (holding ?r ?x)
             (not (ontable ?x))
             (not (clear ?x))
             (not (handempty ?r))))
    
     (:action put-down
      :parameters (?r - robot ?x - cube)
      :precondition (holding ?r ?x)
      :effect (and (ontable ?x)
                   (clear ?x)
                   (handempty ?r)
              (not (holding ?r ?x))))

    (:action stack
     :parameters (?r - robot ?x - cube ?y - cube)
     :precondition (and (holding ?r ?x) (clear ?y))
     :effect (and (on ?x ?y)
                  (clear ?x)
                  (handempty ?r)
             (not (holding ?r ?x))
             (not (clear ?y))))
    
     (:action unstack
     :parameters (?r - robot ?x - cube ?y - cube)
     :precondition (and (on ?x ?y) (clear ?x) (handempty ?r))
     :effect (and (ontable ?x)
                  (clear ?y)
             (not (on ?x ?y))
             ))     

    (:action adjacent-left
    :parameters (?r - robot ?x - cube ?y - cube)
    :precondition (and(holding ?r ?x) (ontable ?y))
    :effect (and (adjacent-left ?x ?y)
                 (ontable ?x)
                 (clear ?x)
                 (handempty ?r)
                 (not (holding ?r ?x))))

    (:action adjacent-right
    :parameters (?r - robot ?x - cube ?y - cube)
    :precondition (and(holding ?r ?x)(ontable ?y))
    :effect (and (adjacent-right ?x ?y)
                 (ontable ?x)
                 (clear ?x)
                 (handempty ?r)
                 (not (holding ?r ?x))))

    (:action adjacent-top
    :parameters (?r - robot ?x - cube ?y - cube)
    :precondition (and (holding ?r ?x) (ontable ?y))
    :effect (and (adjacent-top ?x ?y)
                 (ontable ?x)
                 (clear ?x)
                 (handempty ?r)
                 (not (holding ?r ?x))))

    (:action triangle-three
    :parameters (?r - robot ?x - cube ?top -  cube ?mid - cube)
    :precondition (and (handempty ?r)(ontable ?x)
                  (clear ?x)
                  (clear ?top)
                  (clear ?mid)
                  (adjacent-top ?x ?top))
    :effect (and (not (ontable ?x))
            (on ?mid ?x)
            (clear ?x)
            (handempty ?r)
  )
)        
             
)

; problem
(define (problem goal4p1_blocksworld)
  (:domain blocksworld)

  (:objects
    r - robot
    red red2 red3 red4 red5 red6 red7 red8 red9 red10 - cube
  )

    
    (:init
  (ontable red)
  (ontable red2)
  (ontable red3)
  (ontable red4)
  (ontable red5)
  (ontable red6)
  (ontable red7)
  (ontable red8)
  (ontable red9)
  (ontable red10)
  (clear red)
  (clear red2)
  (clear red3)
  (clear red4)
  (clear red5)
  (clear red6)
  (clear red7)
  (clear red8)
  (clear red9)
  (clear red10)
  (handempty r)
  )
    (:goal
      (and
        (clear red10)
        (clear red7)
        (clear red9)

        (on red10 red8)
        (on red7 red2)
        (on red8 red3)
        (on red9 red5)


        (ontable red)
        (ontable red2)
        (ontable red3)
        (ontable red4)
        (ontable red5)
        (ontable red6)

        ;; adjacency pattern around the central cube
        (adjacent-top  red2   red)
        (adjacent-top  red3   red2)
        (adjacent-right red4 red2)
        (adjacent-right red5 red3)
        (adjacent-right red6 red5)

        (adjacent-top   red8 red7)
        (adjacent-right red9 red8)

        (clear red)
        (clear red4)
        (clear red6)

        (handempty r)
      )
    )
)

; plan
1. (pick-up r red3)
   deleted: (ontable red3) (clear red3) (handempty r)
   added: (holding r red3)
   goals met: 11 of 24
2. (adjacent-top r red3 red2)
   deleted: (holding r red3)
   added: (adjacent-top red3 red2) (ontable red3) (clear red3) (handempty r)
   goals met: 14 of 24
3. (pick-up r red6)
   deleted: (ontable red6) (clear red6) (handempty r)
   added: (holding r red6)
   goals met: 11 of 24
4. (adjacent-right r red6 red5)
   deleted: (holding r red6)
   added: (adjacent-right red6 red5) (ontable red6) (clear red6) (handempty r)
   goals met: 15 of 24
5. (pick-up r red5)
   deleted: (ontable red5) (clear red5) (handempty r)
   added: (holding r red5)
   goals met: 13 of 24
6. (adjacent-right r red5 red3)
   deleted: (holding r red5)
   added: (adjacent-right red5 red3) (ontable red5) (clear red5) (handempty r)
   goals met: 16 of 24
7. (pick-up r red4)
   deleted: (ontable red4) (clear red4) (handempty r)
   added: (holding r red4)
   goals met: 13 of 24
8. (adjacent-right r red4 red2)
   deleted: (holding r red4)
   added: (adjacent-right red4 red2) (ontable red4) (clear red4) (handempty r)
   goals met: 17 of 24
9. (pick-up r red2)
   deleted: (ontable red2) (clear red2) (handempty r)
   added: (holding r red2)
   goals met: 15 of 24
10. (adjacent-top r red2 red)
   deleted: (holding r red2)
   added: (adjacent-top red2 red) (ontable red2) (clear red2) (handempty r)
   goals met: 18 of 24
11. (pick-up r red9)
   deleted: (ontable red9) (clear red9) (handempty r)
   added: (holding r red9)
   goals met: 16 of 24
12. (adjacent-right r red9 red8)
   deleted: (holding r red9)
   added: (adjacent-right red9 red8) (ontable red9) (clear red9) (handempty r)
   goals met: 19 of 24
13. (pick-up r red9)
   deleted: (ontable red9) (clear red9) (handempty r)
   added: (holding r red9)
   goals met: 17 of 24
14. (stack r red9 red5)
   deleted: (holding r red9) (clear red5)
   added: (on red9 red5) (clear red9) (handempty r)
   goals met: 20 of 24
15. (pick-up r red8)
   deleted: (ontable red8) (clear red8) (handempty r)
   added: (holding r red8)
   goals met: 19 of 24
16. (adjacent-top r red8 red7)
   deleted: (holding r red8)
   added: (adjacent-top red8 red7) (ontable red8) (clear red8) (handempty r)
   goals met: 21 of 24
17. (pick-up r red8)
   deleted: (ontable red8) (clear red8) (handempty r)
   added: (holding r red8)
   goals met: 20 of 24
18. (stack r red8 red3)
   deleted: (holding r red8) (clear red3)
   added: (on red8 red3) (clear red8) (handempty r)
   goals met: 22 of 24
19. (pick-up r red10)
   deleted: (ontable red10) (clear red10) (handempty r)
   added: (holding r red10)
   goals met: 20 of 24
20. (stack r red10 red8)
   deleted: (holding r red10) (clear red8)
   added: (on red10 red8) (clear red10) (handempty r)
   goals met: 23 of 24
21. (pick-up r red7)
   deleted: (ontable red7) (clear red7) (handempty r)
   added: (holding r red7)
   goals met: 21 of 24
22. (stack r red7 red2)
   deleted: (holding r red7) (clear red2)
   added: (on red7 red2) (clear red7) (handempty r)
   goals met: 24 of 24
